bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/XMEGA/ATXMEGA128D3.xml
                <register caption="Channel 0 Result" name="CH0RES" offset="0x10" size="2"/>
                <register caption="Compare Value" name="CMP" offset="0x18" size="2"/>
                <register-group caption="ADC Channel 0" name="CH0" offset="0x20" name-in-module="ADC_CH"/>
            </register-group>
            <value-group caption="Current Limitation" name="ADC_CURRLIMIT">
                <value caption="No current limit,     300ksps max sampling rate" name="NO" value="0x00"/>
                <value caption="Low current limit,    250ksps max sampling rate" name="LOW" value="0x01"/>
                <value caption="Medium current limit, 150ksps max sampling rate" name="MED" value="0x02"/>
                <value caption="High current limit,   50ksps max sampling rate" name="HIGH" value="0x03"/>
            </value-group>
            <value-group caption="Positive input multiplexer selection" name="ADC_CH_MUXPOS">
                <value caption="Input pin 0" name="PIN0" value="0x00"/>
                <value caption="Input pin 1" name="PIN1" value="0x01"/>
                <value caption="Input pin 2" name="PIN2" value="0x02"/>
                <value caption="Input pin 3" name="PIN3" value="0x03"/>
                <value caption="Input pin 4" name="PIN4" value="0x04"/>
                <value caption="Input pin 5" name="PIN5" value="0x05"/>
                <value caption="Input pin 6" name="PIN6" value="0x06"/>
                <value caption="Input pin 7" name="PIN7" value="0x07"/>
                <value caption="Input pin 8" name="PIN8" value="0x08"/>
                <value caption="Input pin 9" name="PIN9" value="0x09"/>
                <value caption="Input pin 10" name="PIN10" value="0x0A"/>
                <value caption="Input pin 11" name="PIN11" value="0x0B"/>
                <value caption="Input pin 12" name="PIN12" value="0x0C"/>
                <value caption="Input pin 13" name="PIN13" value="0x0D"/>
                <value caption="Input pin 14" name="PIN14" value="0x0E"/>
                <value caption="Input pin 15" name="PIN15" value="0x0F"/>
            </value-group>
            <value-group caption="Internal input multiplexer selections" name="ADC_CH_MUXINT">
                <value caption="Temperature Reference" name="TEMP" value="0x00"/>
                <value caption="Bandgap Reference" name="BANDGAP" value="0x01"/>
                <value caption="1/10 scaled VCC" name="SCALEDVCC" value="0x02"/>
            </value-group>
            <value-group caption="Negative input multiplexer selection" name="ADC_CH_MUXNEG">
                <value caption="Input pin 0 (Input Mode = 2)" name="PIN0" value="0x00"/>
                <value caption="Input pin 1 (Input Mode = 2)" name="PIN1" value="0x01"/>
                <value caption="Input pin 2 (Input Mode = 2)" name="PIN2" value="0x02"/>
                <value caption="Input pin 3 (Input Mode = 2)" name="PIN3" value="0x03"/>
                <value caption="Input pin 4 (Input Mode = 3)" name="PIN4" value="0x00"/>
                <value caption="Input pin 5 (Input Mode = 3)" name="PIN5" value="0x01"/>
                <value caption="Input pin 6 (Input Mode = 3)" name="PIN6" value="0x02"/>
                <value caption="Input pin 7 (Input Mode = 3)" name="PIN7" value="0x03"/>
            </value-group>
            <value-group caption="Negative input multiplexer selection when gain on 4 LSB pins" name="ADC_CH_MUXNEGL">
                <value caption="Input pin 0" name="PIN0" value="0x00"/>
                <value caption="Input pin 1" name="PIN1" value="0x01"/>
                <value caption="Input pin 2" name="PIN2" value="0x02"/>
                <value caption="Input pin 3" name="PIN3" value="0x03"/>
                <value caption="PAD ground" name="GND" value="0x05"/>
                <value caption="Internal ground" name="INTGND" value="0x07"/>
            </value-group>
            <value-group caption="Negative input multiplexer selection when gain on 4 MSB pins" name="ADC_CH_MUXNEGH">
                <value caption="Input pin 4" name="PIN4" value="0x00"/>
                <value caption="Input pin 5" name="PIN5" value="0x01"/>
                <value caption="Input pin 6" name="PIN6" value="0x02"/>
                <value caption="Input pin 7" name="PIN7" value="0x03"/>
                <value caption="Internal ground" name="INTGND" value="0x04"/>
                <value caption="PAD ground" name="GND" value="0x07"/>
            </value-group>
            <value-group caption="Input mode" name="ADC_CH_INPUTMODE">
                <value caption="Internal inputs, no gain" name="INTERNAL" value="0x00"/>
                <value caption="Single-ended input, no gain" name="SINGLEENDED" value="0x01"/>
                <value caption="Differential input, no gain" name="DIFF" value="0x02"/>
                <value caption="Differential input, with gain" name="DIFFWGAIN" value="0x03"/>
            </value-group>
            <value-group caption="Gain factor" name="ADC_CH_GAIN">
                <value caption="1x gain" name="1X" value="0x00"/>
                <value caption="2x gain" name="2X" value="0x01"/>
                <value caption="4x gain" name="4X" value="0x02"/>
                <value caption="8x gain" name="8X" value="0x03"/>
                <value caption="16x gain" name="16X" value="0x04"/>
                <value caption="32x gain" name="32X" value="0x05"/>
                <value caption="64x gain" name="64X" value="0x06"/>
                <value caption="x/2 gain" name="DIV2" value="0x07"/>
            </value-group>
            <value-group caption="Conversion result resolution" name="ADC_RESOLUTION">
                <value caption="12-bit right-adjusted result" name="12BIT" value="0x00"/>
                <value caption="8-bit right-adjusted result" name="8BIT" value="0x02"/>
                <value caption="12-bit left-adjusted result" name="LEFT12BIT" value="0x03"/>
            </value-group>
            <value-group caption="Voltage reference selection" name="ADC_REFSEL">
                <value caption="Internal 1V" name="INT1V" value="0x00"/>
                <value caption="Internal VCC / 1.6" name="INTVCC" value="0x01"/>
                <value caption="External reference on PORT A" name="AREFA" value="0x02"/>
                <value caption="External reference on PORT B" name="AREFB" value="0x03"/>
                <value caption="Internal VCC / 2" name="INTVCC2" value="0x04"/>
            </value-group>
            <value-group caption="Event channel input selection" name="ADC_EVSEL">
                <value caption="Event Channel 0" name="0" value="0x00"/>
                <value caption="Event Channel 1" name="1" value="0x01"/>
                <value caption="Event Channel 2" name="2" value="0x02"/>
                <value caption="Event Channel 3" name="3" value="0x03"/>
            </value-group>
