bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/XMEGA/ATXMEGA128D3.xml
            <value-group caption="Event action selection" name="ADC_EVACT">
                <value caption="No event action" name="NONE" value="0x00"/>
                <value caption="First event triggers channel 0" name="CH0" value="0x01"/>
                <value caption="The ADC is flushed and restarted for accurate timing" name="SYNCSWEEP" value="0x06"/>
            </value-group>
            <value-group caption="Interrupt mode" name="ADC_CH_INTMODE">
                <value caption="Interrupt on conversion complete" name="COMPLETE" value="0x00"/>
                <value caption="Interrupt on result below compare value" name="BELOW" value="0x01"/>
                <value caption="Interrupt on result above compare value" name="ABOVE" value="0x03"/>
            </value-group>
            <value-group caption="Interrupt level" name="ADC_CH_INTLVL">
                <value caption="Interrupt disabled" name="OFF" value="0x00"/>
                <value caption="Low level" name="LO" value="0x01"/>
                <value caption="Medium level" name="MED" value="0x02"/>
                <value caption="High level" name="HI" value="0x03"/>
            </value-group>
            <value-group caption="Clock prescaler" name="ADC_PRESCALER">
                <value caption="Divide clock by 4" name="DIV4" value="0x00"/>
                <value caption="Divide clock by 8" name="DIV8" value="0x01"/>
                <value caption="Divide clock by 16" name="DIV16" value="0x02"/>
                <value caption="Divide clock by 32" name="DIV32" value="0x03"/>
                <value caption="Divide clock by 64" name="DIV64" value="0x04"/>
                <value caption="Divide clock by 128" name="DIV128" value="0x05"/>
                <value caption="Divide clock by 256" name="DIV256" value="0x06"/>
                <value caption="Divide clock by 512" name="DIV512" value="0x07"/>
            </value-group>
            <interrupt-group name="ADC">
                <interrupt index="0" name="CH0" caption="Interrupt 0"/>
            </interrupt-group>
        </module>
        <module name="RTC" id="I6093" caption="Real-Time Counter">
            <register-group caption="Real-Time Counter" name="RTC" size="14">
                <register caption="Control Register" name="CTRL" offset="0x00" size="1">
                    <bitfield caption="Prescaling Factor" mask="0x07" name="PRESCALER" values="RTC_PRESCALER"/>
                </register>
                <register caption="Status Register" name="STATUS" offset="0x01" size="1">
                    <bitfield caption="Synchronization Busy Flag" mask="0x01" name="SYNCBUSY"/>
                </register>
                <register caption="Interrupt Control Register" name="INTCTRL" offset="0x02" size="1">
                    <bitfield caption="Compare Match Interrupt Level" mask="0x0C" name="COMPINTLVL"
                              values="RTC_COMPINTLVL"/>
                    <bitfield caption="Overflow Interrupt Level" mask="0x03" name="OVFINTLVL" values="RTC_OVFINTLVL"/>
                </register>
                <register caption="Interrupt Flags" name="INTFLAGS" offset="0x03" size="1">
                    <bitfield caption="Compare Match Interrupt Flag" mask="0x02" name="COMPIF"/>
                    <bitfield caption="Overflow Interrupt Flag" mask="0x01" name="OVFIF"/>
                </register>
                <register caption="Temporary register" name="TEMP" offset="0x04" size="1"/>
                <register caption="Count Register" name="CNT" offset="0x08" size="2"/>
                <register caption="Period Register" name="PER" offset="0x0A" size="2"/>
                <register caption="Compare Register" name="COMP" offset="0x0C" size="2"/>
            </register-group>
            <value-group caption="Prescaler Factor" name="RTC_PRESCALER">
                <value caption="RTC Off" name="OFF" value="0x00"/>
                <value caption="RTC Clock" name="DIV1" value="0x01"/>
                <value caption="RTC Clock / 2" name="DIV2" value="0x02"/>
                <value caption="RTC Clock / 8" name="DIV8" value="0x03"/>
                <value caption="RTC Clock / 16" name="DIV16" value="0x04"/>
                <value caption="RTC Clock / 64" name="DIV64" value="0x05"/>
                <value caption="RTC Clock / 256" name="DIV256" value="0x06"/>
                <value caption="RTC Clock / 1024" name="DIV1024" value="0x07"/>
            </value-group>
            <value-group caption="Compare Interrupt level" name="RTC_COMPINTLVL">
                <value caption="Interrupt Disabled" name="OFF" value="0x00"/>
                <value caption="Low Level" name="LO" value="0x01"/>
                <value caption="Medium Level" name="MED" value="0x02"/>
                <value caption="High Level" name="HI" value="0x03"/>
            </value-group>
            <value-group caption="Overflow Interrupt level" name="RTC_OVFINTLVL">
                <value caption="Interrupt Disabled" name="OFF" value="0x00"/>
                <value caption="Low Level" name="LO" value="0x01"/>
                <value caption="Medium Level" name="MED" value="0x02"/>
                <value caption="High Level" name="HI" value="0x03"/>
            </value-group>
            <interrupt-group name="RTC">
                <interrupt index="0" name="OVF" caption="Overflow Interrupt"/>
                <interrupt index="1" name="COMP" caption="Compare Interrupt"/>
            </interrupt-group>
        </module>
        <module name="TWI" id="I6089" caption="Two-Wire Interface">
            <register-group caption="" name="TWI_MASTER" size="7">
                <register caption="Control Register A" name="CTRLA" offset="0x00" size="1">
                    <bitfield caption="Interrupt Level" mask="0xC0" name="INTLVL" values="TWI_MASTER_INTLVL"/>
                    <bitfield caption="Read Interrupt Enable" mask="0x20" name="RIEN"/>
                    <bitfield caption="Write Interrupt Enable" mask="0x10" name="WIEN"/>
                    <bitfield caption="Enable TWI Master" mask="0x08" name="ENABLE"/>
                </register>
                <register caption="Control Register B" name="CTRLB" offset="0x01" size="1">
                    <bitfield caption="Inactive Bus timeout" mask="0x0C" name="TIMEOUT" values="TWI_MASTER_TIMEOUT"/>
                    <bitfield caption="Quick Command Enable" mask="0x02" name="QCEN"/>
                    <bitfield caption="Smart Mode Enable" mask="0x01" name="SMEN"/>
                </register>
