bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/XMEGA/ATXMEGA128D3.xml
            <value-group caption="SPI Mode" name="SPI_MODE">
                <value caption="SPI Mode 0" name="0" value="0x00"/>
                <value caption="SPI Mode 1" name="1" value="0x01"/>
                <value caption="SPI Mode 2" name="2" value="0x02"/>
                <value caption="SPI Mode 3" name="3" value="0x03"/>
            </value-group>
            <value-group caption="Prescaler setting" name="SPI_PRESCALER">
                <value caption="System Clock / 4" name="DIV4" value="0x00"/>
                <value caption="System Clock / 16" name="DIV16" value="0x01"/>
                <value caption="System Clock / 64" name="DIV64" value="0x02"/>
                <value caption="System Clock / 128" name="DIV128" value="0x03"/>
            </value-group>
            <value-group caption="Interrupt level" name="SPI_INTLVL">
                <value caption="Interrupt Disabled" name="OFF" value="0x00"/>
                <value caption="Low Level" name="LO" value="0x01"/>
                <value caption="Medium Level" name="MED" value="0x02"/>
                <value caption="High Level" name="HI" value="0x03"/>
            </value-group>
            <interrupt-group name="SPI">
                <interrupt index="0" name="INT" caption="SPI Interrupt"/>
            </interrupt-group>
        </module>
        <module name="IRCOM" id="I6090" caption="IR Communication Module">
            <register-group caption="IR Communication Module" name="IRCOM" size="3">
                <register caption="Control Register" name="CTRL" offset="0x00" size="1">
                    <bitfield caption="Event Channel Select" mask="0x0F" name="EVSEL" values="IRDA_EVSEL"/>
                </register>
                <register caption="IrDA Transmitter Pulse Length Control Register" name="TXPLCTRL" offset="0x01"
                          size="1"/>
                <register caption="IrDA Receiver Pulse Length Control Register" name="RXPLCTRL" offset="0x02" size="1"/>
            </register-group>
            <value-group caption="Event channel selection" name="IRDA_EVSEL">
                <value caption="No Event Source" name="OFF" value="0x00"/>
                <value caption="Event Channel 0" name="0" value="0x08"/>
                <value caption="Event Channel 1" name="1" value="0x09"/>
                <value caption="Event Channel 2" name="2" value="0x0A"/>
                <value caption="Event Channel 3" name="3" value="0x0B"/>
                <value caption="Event Channel 4" name="4" value="0x0C"/>
                <value caption="Event Channel 5" name="5" value="0x0D"/>
                <value caption="Event Channel 6" name="6" value="0x0E"/>
                <value caption="Event Channel 7" name="7" value="0x0F"/>
            </value-group>
        </module>
    </modules>
    <pinouts>
        <pinout name="QFP_QFN_64">
            <pin pad="PA3" position="1"/>
            <pin pad="PA4" position="2"/>
            <pin pad="PA5" position="3"/>
            <pin pad="PA6" position="4"/>
            <pin pad="PA7" position="5"/>
            <pin pad="PB0" position="6"/>
            <pin pad="PB1" position="7"/>
            <pin pad="PB2" position="8"/>
            <pin pad="PB3" position="9"/>
            <pin pad="PB4" position="10"/>
            <pin pad="PB5" position="11"/>
            <pin pad="PB6" position="12"/>
            <pin pad="PB7" position="13"/>
            <pin pad="GND" position="14"/>
            <pin pad="VCC" position="15"/>
            <pin pad="PC0" position="16"/>
            <pin pad="PC1" position="17"/>
            <pin pad="PC2" position="18"/>
            <pin pad="PC3" position="19"/>
            <pin pad="PC4" position="20"/>
            <pin pad="PC5" position="21"/>
            <pin pad="PC6" position="22"/>
            <pin pad="PC7" position="23"/>
            <pin pad="GND" position="24"/>
            <pin pad="VCC" position="25"/>
            <pin pad="PD0" position="26"/>
            <pin pad="PD1" position="27"/>
            <pin pad="PD2" position="28"/>
            <pin pad="PD3" position="29"/>
            <pin pad="PD4" position="30"/>
            <pin pad="PD5" position="31"/>
            <pin pad="PD6" position="32"/>
            <pin pad="PD7" position="33"/>
            <pin pad="GND" position="34"/>
            <pin pad="VCC" position="35"/>
            <pin pad="PE0" position="36"/>
            <pin pad="PE1" position="37"/>
            <pin pad="PE2" position="38"/>
            <pin pad="PE3" position="39"/>
            <pin pad="PE4" position="40"/>
            <pin pad="PE5" position="41"/>
            <pin pad="PE6" position="42"/>
            <pin pad="PE7" position="43"/>
            <pin pad="GND" position="44"/>
            <pin pad="VCC" position="45"/>
            <pin pad="PF0" position="46"/>
            <pin pad="PF1" position="47"/>
            <pin pad="PF2" position="48"/>
            <pin pad="PF3" position="49"/>
            <pin pad="PF4" position="50"/>
            <pin pad="PF5" position="51"/>
            <pin pad="GND" position="52"/>
            <pin pad="VCC" position="53"/>
            <pin pad="PF6" position="54"/>
            <pin pad="PF7" position="55"/>
            <pin pad="PDI" position="56"/>
            <pin pad="RESET" position="57"/>
            <pin pad="PR0" position="58"/>
            <pin pad="PR1" position="59"/>
            <pin pad="GND" position="60"/>
            <pin pad="AVCC" position="61"/>
            <pin pad="PA0" position="62"/>
            <pin pad="PA1" position="63"/>
            <pin pad="PA2" position="64"/>
        </pinout>
    </pinouts>
</target-description-file>
